---
type: FabricAreaType
namespace: Autodesk.Revit.DB.Structure
version: 2024
members: 2
tags: [revit-api, class]
---

# FabricAreaType

`Autodesk.Revit.DB.Structure.FabricAreaType` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | CreateDefaultFabricAreaType | 2015 | `public static ElementId CreateDefaultFabricAreaType ( Document aDoc )` |
| Property | Parameter | — | `` |